---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationFittingDescription
source: html/ed354ba8-69ae-a754-8bac-39c8e8c71e7d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationFittingDescription Property

"Fabrication Fitting Description"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationFittingDescription { get; }
```